" ------------------------------------------------------------
" GUI関連:
" ------------------------------------------------------------
" GUI設定
if !has('gui_running')
  finish
endif




" ------------------------------------------------------------
" GUI関連: フォント関連:
" ------------------------------------------------------------
" フォントの設定
set guifont=Ricty\ Diminished\ Regular:h18

" フォントの設定(wide)
set guifontwide=Ricty\ Diminished\ Regular:h18

" ギリシャ文字などを2バイトで表示
set ambiwidth=double

" 行間のスペース
set linespace=0


" ------------------------------------------------------------
" GUI関連: ウィンドウ関連:
" ------------------------------------------------------------
" ウィンドウの横サイズ
set columns=95

" ウィンドウの高さサイズ
set lines=30

" 透過表示
set transparency=13

" タブを常に表示
set showtabline=2


" ------------------------------------------------------------
" GUI関連: マウス関連:
" ------------------------------------------------------------
" マウスの動作モデルの設定
set mousemodel=extend

" マウスポインターが移動した時に、ウィンドウをフォーカスさせない
set nomousefocus

" insertモードで、マウスポインターを表示させない
set mousehide





set background=dark

